tutorials/viscoelastic/viscoelasticFluidFoam/XPP_SE/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner  Cholesky;

        tolerance        1e-07;
        relTol           0;
        minIter          0;
        maxIter          800;
    }

    U
    {

        solver           BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    taufirst
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tausecond
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tauthird
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    taufourth
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    taufifth
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

    tausixth
    {
        solver            BiCGStab;
        preconditioner   ILU0;

        tolerance         1e-6;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }

}

PISO
{
    nCorrectors    2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p                     0.3;

    U                     0.5;

    taufirst              0.3;
    tausecond             0.3;
    tauthird              0.3;
    taufourth             0.3;
    taufifth              0.3;
    tausixth              0.3;

}


// ************************************************************************* //
